$(function(){
    if((navigator.userAgent.toLowerCase().match(/(iphone|ipod|android|ios|ipad|rv:1.2.3.4|ucweb|windows ce|windows mobile)/i))){
        $(".nav-pills.nav-justified").removeClass("nav-justified");
    }

    var showProductImg=["product.jpg","productList1.jpg","productList2.jpg","productList3.jpg",
        "productList4.jpg","productList5.jpg","productList6.jpg"];
    var productName=["网能 e 盒","不定位漏水检测传感器","PM2.5粉尘检测仪","机柜粘贴式温湿度传感器",
        "蓄电池单体检测系统","点型光电感烟火灾探测器","壁挂式液晶数显式温湿度传感器"];

    var description1=["网能 e 盒，是掌聚网能专为中小机房和网络能源产品开发的一款监控接入设备，它采用220V交流供电，符合中小机房和网能产品的配套设计要求。",
        "网能 e 盒，提供一个RS232接口和一个RJ45（兼容RS485）接口，可接入两个网能产品或传感器，并提供一个USB接口，可接入存储设备或3G上网卡等外部设备。",
        "网能 e 盒，内部提供一个8G的本地存储空间，保存设备的运行日志和数据信息。",
        "网能 e 盒，可自适应解析接入设备和传感器，安装与调试非常简单，客户可通过网页、手机APP等移动终端实时查看接入设备和传感器的运行状态。"];
    var paramater1=["CPU","RAM","Flash ROM","iNAND","网络接口","网络协议","设备接口","浏览器支持",
        "输入电源","外设电源输出","运行环境","其他配置","多语言","硬件程序更新","系统安全性","物理参数",
        "全端口防雷","IEC61000-4-2","环保与安规"];
    var paramaterValue1=["32-bit ARM RISC-based 600 MHz 高速中央处理器（CPU）", "64M Byte SDRAM", "16M  Byte Flash",
        "EMMC 4.51 with HS200 8G Byte", "10/100Mbps高速以太网络自适应", "TCP/IP, UDP, HTTP,   DNS, DHCP, SMTP, SNMP, Telnet, SNTP,  TFTP, ARP, ICMP, HTTPS等",
        "1个RS232，1个RJ45/RS485复合接口///1个USB接口，可兼容存储和3G上网卡等外部设备", "可通过Internet Explorer、Chrome或兼容浏览器直接访问",
        "DC 12V/1.5A", "USB 5V/1A   RS485 12V/1A", "温度:  -10°C ~ 70°C，湿度: 10 ~ 85%", "内建式超长寿命系统时钟，且支持自动校时以达到时钟同步功能",
        "支持简体中文，并可扩充英语等其他语言", "网络升级", "提供基于IP的过滤机制，以及系统操作和控制管理的用户ID和密码保护",
        "150 ×93 ×31（长×宽×高，mm），105g，黑色","全部端口8/20us雷击电流, 共模3KA，差模2KA，适合野外环境", "等级4", "ROHS，EN60950-2000"];
    var character1=["UPS不间断电源","机房专用空调","蓄电池单体检测","电力配电设备，交流配电屏、配电柜、电表、ATS和STS等","环境采集器，包括温湿度、烟感、水浸、PM2.5、SO2等传感器","网络视频摄像头"];

    var description2=["不定位漏水检测传感器及漏水感应线，漏水感应线是采用进口导电聚合物材料和含氟聚合物材料制成的2芯专用检测线，具有强韧的机械性能、耐腐蚀、耐磨损性能。",
        "感应线有3.5m、7.5m、15m三种规格，也可根据用户需要定制特殊长度。",
        "不定位漏水检测传感器及漏水感应线，是为小型机房、实验室、基站、博物馆等小型区域需要进行泄漏检测的低成本漏水检测方案，它具有实时响应快、性价比高、安装方便等特点。"];
    var paramater2=["电源输入", "工作电流","环境温度","环境湿度","检测通道数","线缆长度","检测灵敏度","响应时间","继电器输出","检测水质","静电防护","EFT防护","长×宽×高"];
    var paramaterValue2=["7.5～15VDC", "≤0.1A", "-10℃～50℃", "10%～90%RH","1路", "200m", "可设定8种灵敏度", "<3s", "1路，触点DC30V 1A", "普通自来水、空调水、消防水等", "接触放电:±6KV； 空气放电:±8KV", "±2KV",
        "88×37×59 （长×宽×高，mm）"];
    var character2=["提供1路检测线缆接口，接入2芯漏水检测线缆，监测范围广，最大检测距离可达200m；",
        "实时响应快，响应时间<3s，采用进口材料制作，对各种水质都具有优异的检测灵敏度和快速反应时间；",
        "具有1路继电器输出，用于输出告警信号或泄漏控制；",
        "具有2个LED状态指示，能迅速直观了解漏液检测系统的工作状态；",
        "端口具有EMC设计，抗干扰能力强，长期稳定性高；",
        "耐腐蚀、耐磨损性强；线缆制作添加特殊材料，具有很强的耐酸碱腐蚀和抗磨损特性；",
        "寿命长，工业级设计标准，使用时间10年"];

    var description3=["PM2.5粉尘检测仪，是一款数字式通用颗粒物浓度传感器，可以用于获得单位体积内空气中 0.3～10微米悬浮颗粒物个数，也可以获得每种粒子的质量数据。",
        "PM2.5粉尘检测仪，采用激光散射原理，令激光照射在空气中的悬浮颗粒物上产生散射，同时在某一特定角度收集散射光，得到散射光强随时间变化的曲线。微处理器采集数据后，" +
        "通过傅立叶变换得到时域与频域间的关系，随后经过一系列复杂算法得出颗粒物的等效粒径及单位体积内不同粒径的颗粒物数量。",
        "该传感器采用RS485接口，直接用网线接入网能e盒，无需额外提供电源，具有安装简单，显示直观、精度高等特点。"];
    var paramater3=["参数","测量范围","量程","响应时间","工作温度范围","平均无故障时间"];
    var paramaterValue3=["指标 (单位)","0.3～1.0、1.0～2.5、2.5～10 (微米)","0～500(ug/m3)", "<10 (秒)", "-20～+50 (摄氏度)", ">5 (年)"];
    var character3=["采用最新专利技术敏感元件，具有自恢复自校正功能，精度高；","数据准确","响应迅速","二阶曲线多点校准","最小分辨粒径 0.3微米"];

    var description4=["机柜粘贴式温湿度传感器，采用最新专利技术的半导体敏感器件设计方案，并具有专利技术的自动恢复自校准功能，用于测量室内环境的温度和湿度的传感器。",
        "该传感器采用RS485接口，直接用网线接入网能e盒，无需额外提供电源。多个传感器可直接串联安装，具有安装简单，显示直观、精度高等特点。",
        "该传感器已广泛应用于通讯机房、IDC数据机房、空调室、实验室、图书馆、办公室等室内场所的温湿度测量。"];
    var paramater4=["产品型号","电压及功耗","温度范围","湿度范围","温度误差","湿度误差","物理接口","传输距离","地址范围", "通信协议","波特率", "数据格式","EFT(脉冲群)","ESD(静电)","外形尺寸"];
    var paramaterValue4=["机柜粘贴式温湿度传感器","6～15V，额定12VDC，功耗约0.1W","-20℃～80℃","0～100%rh","<±0.3℃，在25℃时测试。","<±3%RH， 在25℃时测试。","RS485,最大节点数256。",
        "1200m，屏蔽双绞线。","0-254, 通过RS485设置。","MODBUS-RTU","2400, 4800, 9600可选择，出厂默认设置9600bps。","N, 8, 1","差模±2KV","接触放电±6KV ，空气放电±8KV","72×42×25（长×宽×高，mm）"];
    var character4=["采用最新专利技术敏感元件，具有自恢复自校正功能，精度高；","大屏幕高亮度LCD显示，观察直观、操作简便；",
        "具有温度单位选择：摄氏度(℃)、华氏度(℉)可设置，可在全球范围使用；","具有RS485接口，使用网线连接，网能e盒自适应协议；",
        "独特风道设计，电路温升不影响传感器检测性能；","外接端口具有抗电磁干扰设计，可靠性高；","模块化结构，安装、维护方便"];

    var description5=["蓄电池在电力、通信、金融等行业是一种最为常用的后备电源，如果使用不当或者不能及时维护，经常会导致蓄电池组中个别电池的早期失效。" +
    "为保证不间断供电系统的安全可靠运行，对蓄电池进行实时在线监测和故障诊断是蓄电池维护工作的一个重要任务。",
        "蓄电池单体检测系统，实现对电池组中单体电压、电流、温度、和内阻等参数的检测，并按用户定义的时间间隔将参数传送给客户，并准确预测电池组的运行状况，" +
        "把电池组的潜在危险排除在萌芽状态，有效地保证了不间断电源系统的安全性。",
        "该传感器采用RS485接口，直接用网线接入网能e盒，无需额外提供电源，具有安装简单，显示直观、精度高等特点。"];
    var paramater5=["输入电源","功耗","环境温度","环境湿度","输入范围","采集精度","测量范围","采集精度","测量范围",
        "采集精度","测量范围","采集精度","接口方式","通信参数","ESD防护","EFT防护"];
    var paramaterValue5=["5～16V（6V、12V电池）1～3V（2V电池）  (备注：电池自供电)", "＜0.2W (备注：平均功耗)", "-10℃～40℃", "10%～90%RH", "5～16V（6V、12V电池 200AH）", "1～3V（2V电池 1000AH）", "误差<0.2% FS", "0～100mΩ", "误差<2% FS  (备注：静态测试)", "0～70℃", "±3℃",
        "0～70℃", "误差<1℃ (备注：与传感器精度有关)", "光耦隔离异步串口","9600、N、8、1", "接触放电:±6KV；空气放电:±8KV", "±2KV"];
    var character5=["采用先进的内阻检测和分析技术，实时检测和分析蓄电池的内阻变化趋势，准确预测电池组中的落后蓄电池；",
        "实时采集每节电池的电压、内阻、温度。每个模块有1个内置温度和1个外接温度通道；",
        "对电池组的运行状态提供早期预报，为电池维护或更换提供可靠依据；",
        "选配外接温度传感器，可以检测电池表面、电池柜、室内环境的温度；",
        "模块结构设计，对不同数量的电池组可进行灵活配置，实现方案成本最低化；",
        "电路端口具有EMC设计，具有超强的抗电磁干扰能力，对高频机UPS电池组均能够达到很高的测量精度；"];

    var description6=["烟感火灾探测器，采用美国原装进口CPU高速计算，用于室内火灾报警。","该传感器采用RS485接口，直接用网线接入网能e盒，无需额外提供电源，具有安装简单，显示直观等特点。",
        "该传感器已广泛应用于通讯机房、IDC数据机房、空调室、实验室、图书馆、办公室等室内场所的烟雾火灾探测系统。"];
    var paramater6=["产品型号", "工作环境", "工作电压", "工作电流", "工作指示",
        "接线方式", "安装方式", "适用底座", "保护面积", "编码类型", "执行标准"];
    var paramaterValue6=["JTY-GD-930||JTY-GD-930K", "室内，温度-10℃～+55℃，相对湿度≤95%（40℃±2℃无凝露）", "总线24V	 || DC24V±20%",
        "监视状态：＜300uA 报警状态：＜1.5mA	|| 监视状态：＜50uA 报警状态：1mA～20mA", "状态指示灯，巡检时闪烁，报警时常亮", "二线制",
        "天花板吸顶式安装", "DZ-910	|| DZ-910K", "约80㎡（层高≤12m）参照GB50116-98《火灾自动报警系统设计规范》", "电编码型 || 非编码型", "GB4715-2005《点型感烟火灾探测器》"];
    var character6=["内置美国原装进口CPU，运算速度快，性能可靠","无极性信号二总线，方便施工布线，避免接线错误","采用后向散射迷宫，对不同种类材质燃烧产生的烟雾都灵敏",
        "探测器的报警灵敏度可在控制器中三级可调，适应不同的环境需求","采用漂移补偿算法，对灰尘累积通过软件自动调整，延长使用周期，减少灰尘污染引起的误报","具有传感器件失效检测、上报功能，保证系统的可靠运行，方便维护管理",
        "独有的生产工艺，在高温、高湿、高寒及高海拔的环境下都能正常使用","ESD静电防护等级12000V，抗干扰能力更强"];

    var description7=["壁挂式液晶数显式温湿度传感器，采用最新专利技术的半导体敏感器件设计方案，并具有专利技术的自动恢复自校准功能，用于测量室内环境的温度和湿度的传感器。",
        "该传感器采用RS485接口，直接用网线接入网能e盒，无需额外提供电源，具有安装简单，显示直观、精度高等特点。",
        "该传感器已广泛应用于通讯机房、IDC数据机房、空调室、实验室、图书馆、办公室等室内场所的温湿度测量。"];
    var paramater7=["产品型号","输出方式","工作电压","温度范围", "湿度范围", "温度误差", "湿度误差", "物理接口",
        "传输距离", "地址范围", "通信协议", "波特率", "数据格式", "EFT(脉冲群)", "ESD(静电)","物理参数"];
    var paramaterValue7=["壁挂式液晶数显式温湿度传感器","RS485接口，网线接口","12VDC（6V～15VDC）","-20℃～80℃ 或 -4°F～176°F",
        "0～100%RH", "<±0.3℃，在25℃时测试。", "<±3%RH， 在25℃时测试。", "RS485", "1200m，屏蔽双绞线。", "1-255, 通过按键设置。",
        "MODBUS-RTU", "2400, 4800, 9600可选择，出厂默认设置9600bps。", "N, 8, 1", "差模±2KV", "接触放电±6KV ，空气放电±8KV","80×80×30（长×宽×高，mm），250g"];
    var character7=["采用最新专利技术敏感元件，具有自恢复自校正功能，精度高；","大屏幕高亮度LCD显示，观察直观、操作简便；","具有温度单位选择：摄氏度(℃)、华氏度(℉)可设置，可在全球范围使用；",
        "具有RS485接口，使用网线连接，网能e盒自适应协议；","独特风道设计，电路温升不影响传感器检测性能；","外接端口具有抗电磁干扰设计，可靠性高；","模块化结构，安装、维护方便"];

    var descriptions=[description1,description2,description3,description4,description5,description6,description7];
    var characters=[character1,character2,character3,character4,character5,character6,character7];
    var paramaters=[paramater1,paramater2,paramater3,paramater4,paramater5,paramater6,paramater7];
    var paramaterValues=[paramaterValue1,paramaterValue2,paramaterValue3,paramaterValue4,paramaterValue5,paramaterValue6,paramaterValue7];

    $("#about .container").append('<div class="row white"><div class="col-md-6">'
        +'<img class="img-responsive" id="sensor0" onclick="lookSensor(this)" src="assets/img/others/ad/product.jpg"  align></div>'
    +'<div id="show-pro" class="col-md-6 show-pro"></div></div>');
    $("#show-pro").append('<h3 class="productName">'+productName[0]+'</h3>');
    for(var i=0;i<description1.length;i++){
        $("#show-pro").append('<p class="description">'+description1[i]+'</p>')
    }

    $("#about .container").append('<div id="product-row" class="row sensor"></div>');
    /*每行只有三个产品*/
    for(var m=1;m<productName.length;m++){
        $("#product-row").append('<div class="col-md-4"><div class="grid mask">'
            +'<figure><img class="img-responsive" src="./assets/img/others/ad/'+showProductImg[m]+'" alt="">'
            +'<figcaption><h5>'+productName[m]+'</h5><a class="btn btn-default" id="sensor'+m+'" onclick="lookSensor(this)">查看详情</a>'
            +'</figcaption></figure>'
            +'</div></div>')
    }
});
var showProductImg=["product.jpg","productList1.jpg","productList2.jpg","productList3.jpg",
    "productList4.jpg","productList5.jpg","productList6.jpg"];
var productName=["网能 e 盒","不定位漏水检测传感器","PM2.5粉尘检测仪","机柜粘贴式温湿度传感器",
    "蓄电池单体检测系统","点型光电感烟火灾探测器","壁挂式液晶数显式温湿度传感器"];

var description1=["网能 e 盒，是掌聚网能专为中小机房和网络能源产品开发的一款监控接入设备，它采用220V交流供电，符合中小机房和网能产品的配套设计要求。",
    "网能 e 盒，提供一个RS232接口和一个RJ45（兼容RS485）接口，可接入两个网能产品或传感器，并提供一个USB接口，可接入存储设备或3G上网卡等外部设备。",
    "网能 e 盒，内部提供一个8G的本地存储空间，保存设备的运行日志和数据信息。",
    "网能 e 盒，可自适应解析接入设备和传感器，安装与调试非常简单，客户可通过网页、手机APP等移动终端实时查看接入设备和传感器的运行状态。"];
var paramater1=["CPU","RAM","Flash ROM","iNAND","网络接口","网络协议","设备接口","浏览器支持",
    "输入电源","外设电源输出","运行环境","其他配置","多语言","硬件程序更新","系统安全性","物理参数",
    "全端口防雷","IEC61000-4-2","环保与安规"];
var paramaterValue1=["32-bit ARM RISC-based 600 MHz 高速中央处理器（CPU）", "64M Byte SDRAM", "16M  Byte Flash",
    "EMMC 4.51 with HS200 8G Byte", "10/100Mbps高速以太网络自适应", "TCP/IP, UDP, HTTP,   DNS, DHCP, SMTP, SNMP, Telnet, SNTP,  TFTP, ARP, ICMP, HTTPS等",
    "1个RS232，1个RJ45/RS485复合接口///1个USB接口，可兼容存储和3G上网卡等外部设备", "可通过Internet Explorer、Chrome或兼容浏览器直接访问",
    "DC 12V/1.5A", "USB 5V/1A   RS485 12V/1A", "温度:  -10°C ~ 70°C，湿度: 10 ~ 85%", "内建式超长寿命系统时钟，且支持自动校时以达到时钟同步功能",
    "支持简体中文，并可扩充英语等其他语言", "网络升级", "提供基于IP的过滤机制，以及系统操作和控制管理的用户ID和密码保护",
    "150 ×93 ×31（长×宽×高，mm），105g，黑色","全部端口8/20us雷击电流, 共模3KA，差模2KA，适合野外环境", "等级4", "ROHS，EN60950-2000"];
var character1=["UPS不间断电源","机房专用空调","蓄电池单体检测","电力配电设备，交流配电屏、配电柜、电表、ATS和STS等","环境采集器，包括温湿度、烟感、水浸、PM2.5、SO2等传感器","网络视频摄像头"];

var description2=["不定位漏水检测传感器及漏水感应线，漏水感应线是采用进口导电聚合物材料和含氟聚合物材料制成的2芯专用检测线，具有强韧的机械性能、耐腐蚀、耐磨损性能。",
    "感应线有3.5m、7.5m、15m三种规格，也可根据用户需要定制特殊长度。",
    "不定位漏水检测传感器及漏水感应线，是为小型机房、实验室、基站、博物馆等小型区域需要进行泄漏检测的低成本漏水检测方案，它具有实时响应快、性价比高、安装方便等特点。"];
var paramater2=["电源输入", "工作电流","环境温度","环境湿度","检测通道数","线缆长度","检测灵敏度","响应时间","继电器输出","检测水质","静电防护","EFT防护","长×宽×高"];
var paramaterValue2=["7.5～15VDC", "≤0.1A", "-10℃～50℃", "10%～90%RH","1路", "200m", "可设定8种灵敏度", "<3s", "1路，触点DC30V 1A", "普通自来水、空调水、消防水等", "接触放电:±6KV； 空气放电:±8KV", "±2KV",
    "88×37×59 （长×宽×高，mm）"];
var character2=["提供1路检测线缆接口，接入2芯漏水检测线缆，监测范围广，最大检测距离可达200m；",
    "实时响应快，响应时间<3s，采用进口材料制作，对各种水质都具有优异的检测灵敏度和快速反应时间；",
    "具有1路继电器输出，用于输出告警信号或泄漏控制；",
    "具有2个LED状态指示，能迅速直观了解漏液检测系统的工作状态；",
    "端口具有EMC设计，抗干扰能力强，长期稳定性高；",
    "耐腐蚀、耐磨损性强；线缆制作添加特殊材料，具有很强的耐酸碱腐蚀和抗磨损特性；",
    "寿命长，工业级设计标准，使用时间10年"];

var description3=["PM2.5粉尘检测仪，是一款数字式通用颗粒物浓度传感器，可以用于获得单位体积内空气中 0.3～10微米悬浮颗粒物个数，也可以获得每种粒子的质量数据。",
    "PM2.5粉尘检测仪，采用激光散射原理，令激光照射在空气中的悬浮颗粒物上产生散射，同时在某一特定角度收集散射光，得到散射光强随时间变化的曲线。微处理器采集数据后，" +
    "通过傅立叶变换得到时域与频域间的关系，随后经过一系列复杂算法得出颗粒物的等效粒径及单位体积内不同粒径的颗粒物数量。",
    "该传感器采用RS485接口，直接用网线接入网能e盒，无需额外提供电源，具有安装简单，显示直观、精度高等特点。"];
var paramater3=["参数","测量范围","量程","响应时间","工作温度范围","平均无故障时间"];
var paramaterValue3=["指标 (单位)","0.3～1.0、1.0～2.5、2.5～10 (微米)","0～500(ug/m3)", "<10 (秒)", "-20～+50 (摄氏度)", ">5 (年)"];
var character3=["采用最新专利技术敏感元件，具有自恢复自校正功能，精度高；","数据准确","响应迅速","二阶曲线多点校准","最小分辨粒径 0.3微米"];

var description4=["机柜粘贴式温湿度传感器，采用最新专利技术的半导体敏感器件设计方案，并具有专利技术的自动恢复自校准功能，用于测量室内环境的温度和湿度的传感器。",
    "该传感器采用RS485接口，直接用网线接入网能e盒，无需额外提供电源。多个传感器可直接串联安装，具有安装简单，显示直观、精度高等特点。",
    "该传感器已广泛应用于通讯机房、IDC数据机房、空调室、实验室、图书馆、办公室等室内场所的温湿度测量。"];
var paramater4=["产品型号","电压及功耗","温度范围","湿度范围","温度误差","湿度误差","物理接口","传输距离","地址范围", "通信协议","波特率", "数据格式","EFT(脉冲群)","ESD(静电)","外形尺寸"];
var paramaterValue4=["机柜粘贴式温湿度传感器","6～15V，额定12VDC，功耗约0.1W","-20℃～80℃","0～100%rh","<±0.3℃，在25℃时测试。","<±3%RH， 在25℃时测试。","RS485,最大节点数256。",
    "1200m，屏蔽双绞线。","0-254, 通过RS485设置。","MODBUS-RTU","2400, 4800, 9600可选择，出厂默认设置9600bps。","N, 8, 1","差模±2KV","接触放电±6KV ，空气放电±8KV","72×42×25（长×宽×高，mm）"];
var character4=["采用最新专利技术敏感元件，具有自恢复自校正功能，精度高；","大屏幕高亮度LCD显示，观察直观、操作简便；",
    "具有温度单位选择：摄氏度(℃)、华氏度(℉)可设置，可在全球范围使用；","具有RS485接口，使用网线连接，网能e盒自适应协议；",
    "独特风道设计，电路温升不影响传感器检测性能；","外接端口具有抗电磁干扰设计，可靠性高；","模块化结构，安装、维护方便"];

var description5=["蓄电池在电力、通信、金融等行业是一种最为常用的后备电源，如果使用不当或者不能及时维护，经常会导致蓄电池组中个别电池的早期失效。" +
"为保证不间断供电系统的安全可靠运行，对蓄电池进行实时在线监测和故障诊断是蓄电池维护工作的一个重要任务。",
    "蓄电池单体检测系统，实现对电池组中单体电压、电流、温度、和内阻等参数的检测，并按用户定义的时间间隔将参数传送给客户，并准确预测电池组的运行状况，" +
    "把电池组的潜在危险排除在萌芽状态，有效地保证了不间断电源系统的安全性。",
    "该传感器采用RS485接口，直接用网线接入网能e盒，无需额外提供电源，具有安装简单，显示直观、精度高等特点。"];
var paramater5=["输入电源","功耗","环境温度","环境湿度","输入范围","采集精度","测量范围","采集精度","测量范围",
    "采集精度","测量范围","采集精度","接口方式","通信参数","ESD防护","EFT防护"];
var paramaterValue5=["5～16V（6V、12V电池）1～3V（2V电池）  (备注：电池自供电)", "＜0.2W (备注：平均功耗)", "-10℃～40℃", "10%～90%RH", "5～16V（6V、12V电池 200AH）", "1～3V（2V电池 1000AH）", "误差<0.2% FS", "0～100mΩ", "误差<2% FS  (备注：静态测试)", "0～70℃", "±3℃",
    "0～70℃", "误差<1℃ (备注：与传感器精度有关)", "光耦隔离异步串口","9600、N、8、1", "接触放电:±6KV；空气放电:±8KV", "±2KV"];
var character5=["采用先进的内阻检测和分析技术，实时检测和分析蓄电池的内阻变化趋势，准确预测电池组中的落后蓄电池；",
    "实时采集每节电池的电压、内阻、温度。每个模块有1个内置温度和1个外接温度通道；",
    "对电池组的运行状态提供早期预报，为电池维护或更换提供可靠依据；",
    "选配外接温度传感器，可以检测电池表面、电池柜、室内环境的温度；",
    "模块结构设计，对不同数量的电池组可进行灵活配置，实现方案成本最低化；",
    "电路端口具有EMC设计，具有超强的抗电磁干扰能力，对高频机UPS电池组均能够达到很高的测量精度；"];

var description6=["烟感火灾探测器，采用美国原装进口CPU高速计算，用于室内火灾报警。","该传感器采用RS485接口，直接用网线接入网能e盒，无需额外提供电源，具有安装简单，显示直观等特点。",
    "该传感器已广泛应用于通讯机房、IDC数据机房、空调室、实验室、图书馆、办公室等室内场所的烟雾火灾探测系统。"];
var paramater6=["产品型号", "工作环境", "工作电压", "工作电流", "工作指示",
    "接线方式", "安装方式", "适用底座", "保护面积", "编码类型", "执行标准"];
var paramaterValue6=["JTY-GD-930||JTY-GD-930K", "室内，温度-10℃～+55℃，相对湿度≤95%（40℃±2℃无凝露）", "总线24V	 || DC24V±20%",
    "监视状态：＜300uA 报警状态：＜1.5mA	|| 监视状态：＜50uA 报警状态：1mA～20mA", "状态指示灯，巡检时闪烁，报警时常亮", "二线制",
    "天花板吸顶式安装", "DZ-910	|| DZ-910K", "约80㎡（层高≤12m）参照GB50116-98《火灾自动报警系统设计规范》", "电编码型 || 非编码型", "GB4715-2005《点型感烟火灾探测器》"];
var character6=["内置美国原装进口CPU，运算速度快，性能可靠","无极性信号二总线，方便施工布线，避免接线错误","采用后向散射迷宫，对不同种类材质燃烧产生的烟雾都灵敏",
    "探测器的报警灵敏度可在控制器中三级可调，适应不同的环境需求","采用漂移补偿算法，对灰尘累积通过软件自动调整，延长使用周期，减少灰尘污染引起的误报","具有传感器件失效检测、上报功能，保证系统的可靠运行，方便维护管理",
    "独有的生产工艺，在高温、高湿、高寒及高海拔的环境下都能正常使用","ESD静电防护等级12000V，抗干扰能力更强"];

var description7=["壁挂式液晶数显式温湿度传感器，采用最新专利技术的半导体敏感器件设计方案，并具有专利技术的自动恢复自校准功能，用于测量室内环境的温度和湿度的传感器。",
    "该传感器采用RS485接口，直接用网线接入网能e盒，无需额外提供电源，具有安装简单，显示直观、精度高等特点。",
    "该传感器已广泛应用于通讯机房、IDC数据机房、空调室、实验室、图书馆、办公室等室内场所的温湿度测量。"];
var paramater7=["产品型号","输出方式","工作电压","温度范围", "湿度范围", "温度误差", "湿度误差", "物理接口",
    "传输距离", "地址范围", "通信协议", "波特率", "数据格式", "EFT(脉冲群)", "ESD(静电)","物理参数"];
var paramaterValue7=["壁挂式液晶数显式温湿度传感器","RS485接口，网线接口","12VDC（6V～15VDC）","-20℃～80℃ 或 -4°F～176°F",
    "0～100%RH", "<±0.3℃，在25℃时测试。", "<±3%RH， 在25℃时测试。", "RS485", "1200m，屏蔽双绞线。", "1-255, 通过按键设置。",
    "MODBUS-RTU", "2400, 4800, 9600可选择，出厂默认设置9600bps。", "N, 8, 1", "差模±2KV", "接触放电±6KV ，空气放电±8KV","80×80×30（长×宽×高，mm），250g"];
var character7=["采用最新专利技术敏感元件，具有自恢复自校正功能，精度高；","大屏幕高亮度LCD显示，观察直观、操作简便；","具有温度单位选择：摄氏度(℃)、华氏度(℉)可设置，可在全球范围使用；",
    "具有RS485接口，使用网线连接，网能e盒自适应协议；","独特风道设计，电路温升不影响传感器检测性能；","外接端口具有抗电磁干扰设计，可靠性高；","模块化结构，安装、维护方便"];

var descriptions=[description1,description2,description3,description4,description5,description6,description7];
var characters=[character1,character2,character3,character4,character5,character6,character7];
var paramaters=[paramater1,paramater2,paramater3,paramater4,paramater5,paramater6,paramater7];
var paramaterValues=[paramaterValue1,paramaterValue2,paramaterValue3,paramaterValue4,paramaterValue5,paramaterValue6,paramaterValue7];

//查看传感器详细信息
function lookSensor(obj){
    var ids=obj.id;
    //产品的Id最后一位
    var index=ids.substring(ids.length-1,ids.length);

    /*产品名称*/
    $("#productName").text(productName[index]);
    $("#showProductImg img").attr("src",'assets/img/others/ad/'+showProductImg[index]+'');
    /*移除产品简介及产品规格说明*/
    $("#productDes .description ,#paramaterTab .paramaters ,#characterTab .paramaters ,#supposeTab .paramaters").remove();

    if(characters[index].length>0){
        if(index==0){
            /*网能E盒*/
            $("#characterPills a").text("支持设备");
        }else {
            /*传感器*/
            $("#characterPills a").text("产品特点");
        }
    }
    /*产品特点*/
    for(var k=0;k<characters[index].length;k++){
        $("#characterTab").append('<div class="paramaters col-lg-12 col-md-12 col-xs-12">'
            +'<p class="description col-lg-12 col-md-12 col-xs-12">'+characters[index][k]+'</p></div>'
            +'<hr class="featurette-divider paramaters col-lg-12 col-md-12 col-xs-12">');
    }
    /*产品简介*/
    for(var k=0;k<descriptions[index].length;k++){
        $("#productDes").append('<p class="description">'+descriptions[index][k]+'</p>');
    }
    /*产品规格参数*/
    if(paramaters[index].length>0){
        for(var m=0;m<paramaters[index].length;m++){
            $("#paramaterTab").append('<div class="paramaters col-lg-12 col-md-12 col-xs-12">'
                +'<div class="col-lg-3 col-md-3 col-xs-4">'
                +'<p>'+paramaters[index][m]+'</p>'
                +'</div>'
                +'<div class="col-lg-9 col-md-9 col-xs-8">'
                +'<p>'+(paramaterValues[index][m].split("///")[0]==undefined?"":paramaterValues[index][m].split("///")[0])+'</p>'
                +'<p>'+(paramaterValues[index][m].split("///")[1]==undefined?"":paramaterValues[index][m].split("///")[1])+'</p>'
                +'</div></div>'
                +'<hr class="featurette-divider paramaters col-lg-12 col-md-12 col-xs-12">');
        }
    }
    $("#myModal").modal("show");
}